app/controllers/comments_controller.rb

  def new
    @post = Post.find_by_web_title params[:post_id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."web_title" = 'post2' LIMIT 1

  def create
    @post = Post.find_by_web_title params[:post_id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."web_title" = 'test' LIMIT 1