app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
      tags = params[:tags].split(',').map{|tag|tag.strip}
      tags.each do |tag|
        @post.tags << Tag.find_or_create_by_name(tag)
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "web_title") VALUES (?, ?, ?, ?, ?)  [["content", "te"], ["created_at", Fri, 23 Dec 2011 07:17:40 UTC +00:00], ["title", "te"], ["updated_at", Fri, 23 Dec 2011 07:17:40 UTC +00:00], ["web_title", "te"]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 05 May 2013 22:48:41 EDT -04:00], ["name", "test"], ["updated_at", Sun, 05 May 2013 22:48:41 EDT -04:00]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'test' LIMIT 1

  def show
    @post = Post.find_by_web_title params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."web_title" = 'favicon' LIMIT 1

  def index
    if params[:tag]
      @posts = Tag.find_by_param(params[:tag]).posts.reverse rescue []
    else
      @posts = Post.all.reverse
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags"