app/controllers/sessions_controller.rb

INSERT INTO "users" ("admin", "created_at", "email", "name", "poker_player", "provider", "special_access", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = 'google' AND "users"."uid" = 'https://www.google.com/accounts/o8/id?id=AItOawk3TPHFdLTq3sQGfT_mNjuqjE4856Vgevg' LIMIT 1
---
  def create
    auth = request.env['omniauth.auth']
    logger.debug auth.to_yaml
    user = User.find_by_provider_and_uid(auth['provider'], auth['uid']) || User.create_with_omniauth(auth)